#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function_lv_autoscale.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lv-as-02"
        name                = "io-p-itn-auth-lv-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
          ~ name = "wallet_gate3" -> "wallet_ga"

          ~ fixed_date {
              ~ end      = "2024-11-20T21:30:00Z" -> "2024-12-04T21:30:00Z"
              ~ start    = "2024-11-20T13:00:00Z" -> "2024-12-04T08:00:00Z"
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (30 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.webprofile_apim_api_itn.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn will be created
  + resource "azurerm_api_management_api_operation_policy" "unlock_user_session_policy_itn" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + operation_id        = "unlockUserSession"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <!-- ApiRateLimit 10 requests/5seconds based on Client IP Address -->
                <rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
                <!-- ApiRateLimit 10 requests/5seconds based on Access Token -->
                <rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("Authorization").AsJwt()?.Claims.GetValueOrDefault("fiscal_number", ""))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_itn.azurerm_api_management_named_value.io_fn3_services_key_itn will be created
  + resource "azurerm_api_management_named_value" "io_fn3_services_key_itn" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "ioweb-profile-api-key"
      + id                  = (known after apply)
      + name                = "ioweb-profile-api-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.webprofile_apim_api_weu.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn will be created
  + resource "azurerm_api_management_api_operation_policy" "unlock_user_session_policy_itn" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + operation_id        = "unlockUserSession"
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <!-- ApiRateLimit 10 requests/5seconds based on Client IP Address -->
                <rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
                <!-- ApiRateLimit 10 requests/5seconds based on Access Token -->
                <rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("Authorization").AsJwt()?.Claims.GetValueOrDefault("fiscal_number", ""))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
              </inbound>
              <backend>
                <base />
              </backend>
              <outbound>
                <base />
              </outbound>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_weu.azurerm_api_management_named_value.io_fn3_services_key_itn will be created
  + resource "azurerm_api_management_named_value" "io_fn3_services_key_itn" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "ioweb-profile-api-key"
      + id                  = (known after apply)
      + name                = "ioweb-profile-api-key"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "Bff API for IO Web platform"
      + display_name          = "IO Web - Bff"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-ioweb-bff"
      + path                  = "ioweb/backend/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https://io-p-itn-auth-webprof-func-01.azurewebsites.net/api/v1"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-web-profile-backend/a2a6be1434e75089fb46e1aba50678cbbe32afd1/openapi/external.yaml"
        }
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <set-header name="x-functions-key" exists-action="override">
                  <value>{{ioweb-profile-api-key}}</value>
                </set-header>
                <cors>
                  <allowed-origins>
                    <origin>https://ioapp.it/</origin>
                  </allowed-origins>
                  <allowed-methods preflight-result-max-age="300">
                    <method>OPTIONS</method>
                    <method>GET</method>
                    <method>POST</method>
                  </allowed-methods>
                  <allowed-headers>
                    <header>Content-Type</header>
                    <header>Authorization</header>
                  </allowed-headers>
                </cors>
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + product_id          = "io-web-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = "http"
      + description           = "Bff API for IO Web platform"
      + display_name          = "IO Web - Bff"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-ioweb-bff"
      + path                  = "ioweb/backend/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = "https://io-p-itn-auth-webprof-func-01.azurewebsites.net/api/v1"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-web-profile-backend/a2a6be1434e75089fb46e1aba50678cbbe32afd1/openapi/external.yaml"
        }
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <set-header name="x-functions-key" exists-action="override">
                  <value>{{ioweb-profile-api-key}}</value>
                </set-header>
                <cors>
                  <allowed-origins>
                    <origin>https://ioapp.it/</origin>
                  </allowed-origins>
                  <allowed-methods preflight-result-max-age="300">
                    <method>OPTIONS</method>
                    <method>GET</method>
                    <method>POST</method>
                  </allowed-methods>
                  <allowed-headers>
                    <header>Content-Type</header>
                    <header>Authorization</header>
                  </allowed-headers>
                </cors>
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-p-ioweb-bff"
      + id                  = (known after apply)
      + product_id          = "io-web-api"
      + resource_group_name = "io-p-rg-internal"
    }

Plan: 10 to add, 3 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service_plan.shared_plan_itn,
  on data.tf line 35, in data "azurerm_app_service_plan" "shared_plan_itn":
  35: data "azurerm_app_service_plan" "shared_plan_itn" {

The `azurerm_app_service_plan` data source has been superseded by the
`azurerm_service_plan` data source. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
